html/20231209T080431--moving-emacsd-into-dotfiles-repo__emacs.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-12-20 Wed 08:50 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>moving emacsd into dotfiles repo</title>
<meta name="author" content="Arvydas Gasparavicius" />
<meta name="description" content="welcome to my site" />
<meta name="keywords" content="emacs antanas geles" />
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="../static/css/org-html-style-default.css" type="text/css"/>
<link rel="stylesheet" href="../static/css/generic.css" type="text/css"/>
<link rel="stylesheet" href="../static/css/taingram.css" type="text/css"/>
<link rel="stylesheet" href="../static/css/lightbox.css" type="text/css"/>
<link rel="stylesheet" href="../static/css/scroll-to-top.css" type="text/css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="sitemap.html">NOTES </a>
 
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="preamble" class="status">
<div id="updated">Updated: 2023-12-14 Thu 19:09</div>
</div>
<div id="content" class="content">
<header>
<h1 class="title">moving emacsd into dotfiles repo</h1>
</header><p>
So today <span class="timestamp-wrapper"><span class="timestamp">[2023-12-09 Sat] </span></span> is a morning for configs.
</p>

<p>
Shell is not working properly(wrong time in wsl). I use tmux sometimes, I use
fish now(config will come also probably), I use vim sometimes, I want my
.bashrc file to look certain way&#x2026; many config files and they are now all over
the place on different machines.
</p>

<p>
I need to have one repo for this.
</p>

<p>
What I did, because I did not want to lose the <code>.emacs.d</code> version history is
renamed that repo to <code>dotfiles</code>. Inside of that dotfiles directory I have
created .emacs.d folder content. I then git clone that folder into any location
on my machine and then link the .emacd.d folder to that git folder like such:
</p>

<div class="org-src-container">
<pre class="src src-bash">cd
# source destination(your wanted new location)
ln -s GIT/dotfiles/.emacs.d/ .emacs.d
</pre>
</div>

<p>
and now when I launch emacs from anywhere inside my wsl, it looks into
<code>GIT/dotfiles/.emacs.d/</code> for my .emacs.d config files. Great.
</p>

<p>
Now in that <code>dotfiles</code> folder I can start putting other config files.
</p>

<p>
<span class="timestamp-wrapper"><span class="timestamp">[2023-12-09 Sat 09:40] </span></span> I have also created a (new machine setup)TODO file in
dotfiles folder which will automatically allow you to configure the new
machine. Great! xoxo
</p>
</div>
<div id="postamble" class="status">
<hr/>
	 <footer>
	 <div class="copyright-container">
	 <div class="copyright">
	 Copyright &copy; 2023-2023 Arvydas Gasparavicius
	 </div>
	 </div>
	 <p class="date">This org file is created: 2023-12-09 Sat 08:04</p>
	 <p class="date">This org file is last modified: 2023-12-14 Thu 19:09</p>
	 <p class="date">This org file is exported to HTML: 2023-12-20 Wed 08:50</p>
	 <div class="generated">
	Created with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.1 (<a href="https://orgmode.org">Org</a> mode 9.6.6) on <a href="https://www.gnu.org">GNU</a>/<a href="https://www.kernel.org/">Linux</a>
	</div>
	</footer>
	 <button onclick="topFunction()" id="myBtn" title="Go to top">Top</button>
	 <script src="../static/js/generic.js"></script>
	 <script src="../static/js/scroll-to-top.js"></script>
	 <script src="../static/js/lightbox.js"></script>
</div>
</body>
</html>